// Модификаторы доступа управляют доступностью членов класса. TypeScript поддерживает 3 модификатора:
//     public, private и protected.

//     - public:
// Элементы с этим модификатором доступны отовсюду без каких-либо ограничений. Этот модификатор установлен
// по умолчанию.

//     - private:
// Элементы с этим модификатором доступны только из того класса, в котором они определены.

//     - protected:
// Элементы с этим модификатором доступны из класса, в котором они определены, и в подклассах/производных классах.

// Примеры в разделе Classes.js.
